app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Sociology"], ["room_number", 2], ["created_at", "2020-10-29 06:12:41.443551"], ["updated_at", "2020-10-29 06:12:41.443551"]]
---
    def create
        @school_class = SchoolClass.create(class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_class
        @school_class = SchoolClass.find(params[:id])