app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ellaine"], ["last_name", "Tolentino"], ["created_at", "2020-10-29 06:30:18.642127"], ["updated_at", "2020-10-29 06:30:18.642127"]]
---
    def create
        @student = Student.new
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_student
        @student = Student.find(params[:id])